Revit 2024 API
DirectShapeType.Create Method
Overload List
Name | Description
Create(Document, String, ElementId)
 Creates a DirectShapeType element.
Create(Document, String, ElementId, DirectShapeTypeOptions)
 Creates a DirectShapeType element.
See Also
DirectShapeType Class
DirectShapeType Members
Autodesk.Revit.DB Namespace